{
  "model_config": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 10,
            "activation": "relu",
            "input_shape": [4]
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "linear"
          }
        }
      ]
    }
  },
  "weights_manifest": {
    "paths": [
      "group1-shard1of1.bin"
    ]
  }
}
