{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Embedding",
          "config": {
            "input_dim": 10000,
            "output_dim": 128,
            "input_length": 5,
            "name": "embedding_1",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 50,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 1.3.2",
    "backend": "tensor_flow.js"
  },
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v1.3.2",
  "convertedBy": null
}
